{
  "ar": {
    "confirmLangTitle": "هل أنت متأكد من اللغة التي تم اختيارها؟",
    "confirmLangDesc": "مع العلم أن التطبيق سيعمل بشكل كامل باللغة التي تم اختيارها، ويمكنكم تغيير اللغة في اي وقت شئتم من لوحة التحكم",
    "audioTitle": "هل توافق على تشغيل الموسيقى والصوتيات في التطبيق؟",
    "audioDesc": "مع العلم أنكم بإمكانكم التحكم في الصوتيات والموسيقى من لوحة التحكم متى شئتم",
    "notificationTitle": "هل توافق على تشغيل إشعارات التطبيق في هاتفك؟",
    "notificationDesc": "ستتلقى إشعارات مهمة حول الوظائف والدورات والتحديثات، ويمكنك التحكم فيها من الإعدادات",
    "yes": "نعم",
    "no": "لا",
    "ok": "تأكيد"
  },
  "en": {
    "confirmLangTitle": "Are you sure about the selected language?",
    "confirmLangDesc": "The app will work entirely in this language, and you can change it anytime from the dashboard.", 
    "audioTitle": "Do you agree to play music and audio in the app?",
    "audioDesc": "You can control audio and music from the dashboard whenever you want.", 
    "notificationTitle": "Do you agree to enable app notifications on your phone?",
    "notificationDesc": "You'll receive important notifications about jobs, courses, and updates. You can control them from settings.",
    "yes": "Yes",
    "no": "No",
    "ok": "Confirm"
  },
  "fr": {
    "confirmLangTitle": "Êtes-vous sûr de la langue sélectionnée ?",
    "confirmLangDesc": "L'application fonctionnera entièrement dans cette langue et vous pourrez la modifier à tout moment depuis le tableau de bord.", 
    "audioTitle": "Acceptez-vous de jouer de la musique et de l'audio dans l'application ?",
    "audioDesc": "Vous pouvez contrôler l'audio et la musique depuis le tableau de bord quand vous le souhaitez.", 
    "notificationTitle": "Acceptez-vous d'activer les notifications de l'application sur votre téléphone ?",
    "notificationDesc": "Vous recevrez des notifications importantes sur les emplois, les cours et les mises à jour. Vous pouvez les contrôler depuis les paramètres.",
    "yes": "Oui",
    "no": "Non",
    "ok": "Confirmer"
  }
}